In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('round2/trades_round_2_day_-1_nn.csv', delimiter=';', index_col=0)
df2 = pd.read_csv('round2/trades_round_2_day_0_nn.csv', delimiter=';', index_col=0)
df2.index = df2.index + int(1e6)

In [3]:
df.tail()

           buyer  seller    symbol   currency   price  quantity
timestamp
998800       NaN     NaN  COCONUTS  SEASHELLS  8114.0        22
998900       NaN     NaN   BANANAS  SEASHELLS  4897.0         1
999200       NaN     NaN   BANANAS  SEASHELLS  4896.0         1
999600       NaN     NaN    PEARLS  SEASHELLS  9998.0         1
999700       NaN     NaN   BANANAS  SEASHELLS  4891.0        12

In [4]:
df2.head()

           buyer  seller   symbol   currency    price  quantity
timestamp
1000100      NaN     NaN   PEARLS  SEASHELLS  10002.0         1
1000300      NaN     NaN   PEARLS  SEASHELLS   9998.0         2
1000300      NaN     NaN   PEARLS  SEASHELLS   9998.0         1
1000400      NaN     NaN  BANANAS  SEASHELLS   4899.0         9
1000500      NaN     NaN  BANANAS  SEASHELLS   4899.0         1

In [5]:
merged = pd.concat([df, df2], axis=0)
merged

           buyer  seller    symbol   currency    price  quantity
timestamp
0            NaN     NaN    PEARLS  SEASHELLS  10004.0         1
0            NaN     NaN   BANANAS  SEASHELLS   4952.0         1
1100         NaN     NaN    PEARLS  SEASHELLS   9996.0         2
1300         NaN     NaN   BANANAS  SEASHELLS   4949.0         3
1600         NaN     NaN  COCONUTS  SEASHELLS   8000.0        30
...          ...     ...       ...        ...      ...       ...
1998800      NaN     NaN   BANANAS  SEASHELLS   4870.0         1
1999200      NaN     NaN  COCONUTS  SEASHELLS   7998.0        44
1999300      NaN     NaN   BANANAS  SEASHELLS   4875.0        17
1999500      NaN     NaN   BANANAS  SEASHELLS   4869.0         2
1999500      NaN     NaN    PEARLS  SEASHELLS   9995.0         2

[11742 rows x 6 columns]

In [6]:
merged.to_csv('round2/trd_train.csv', sep=';')